In [3]:
import pandas as pd

In [4]:
df=pd.read_csv("Orders.csv")
df

    Order ID  Order Date CustomerName             State     City
0    B-26055  10-03-2018    Harivansh     Uttar Pradesh  Mathura
1    B-25993  03-02-2018       Madhav             Delhi    Delhi
2    B-25973  24-01-2018  Madan Mohan     Uttar Pradesh  Mathura
3    B-25923  27-12-2018        Gopal       Maharashtra   Mumbai
4    B-25757  21-08-2018     Vishakha    Madhya Pradesh   Indore
..       ...         ...          ...               ...      ...
495  B-25742  03-08-2018       Ashwin               Goa      Goa
496  B-26088  26-03-2018       Bhavna            Sikkim  Gangtok
497  B-25707  01-07-2018      Shivani       Maharashtra   Mumbai
498  B-25758  22-08-2018      Shubham  Himachal Pradesh    Simla
499  B-26095  28-03-2018      Monisha         Rajasthan   Jaipur

[500 rows x 5 columns]

In [5]:
df1=pd.read_csv("Details.csv")
df1

,Order ID,Amount,Profit,Quantity,Category,Sub-Category,PaymentMode
0,B-25681,1096,658,7,Electronics,Electronic Games,COD
1,B-26055,5729,64,14,Furniture,Chairs,EMI
2,B-25955,2927,146,8,Furniture,Bookcases,EMI
3,B-26093,2847,712,8,Electronics,Printers,Credit Card
4,B-25602,2617,1151,4,Electronics,Phones,Credit Card
...,...,...,...,...,...,...,...
1495,B-25700,7,-3,2,Clothing,Hankerchief,COD
1496,B-25757,3151,-35,7,Clothing,Trousers,EMI
1497,B-25973,4141,1698,13,Electronics,Printers,COD
1498,B-25698,7,-2,1,Clothing,Hankerchief,COD
1499,B-25993,4363,305,5,Furniture,Tables,EMI

In [15]:
df2=pd.merge(df,df1,on="Order ID")
df2

,Order ID,Order Date,CustomerName,State,City,Amount,Profit,Quantity,Category,Sub-Category,PaymentMode
0,B-26055,10-03-2018,Harivansh,Uttar Pradesh,Mathura,5729,64,14,Furniture,Chairs,EMI
1,B-26055,10-03-2018,Harivansh,Uttar Pradesh,Mathura,671,114,9,Electronics,Phones,Credit Card
2,B-26055,10-03-2018,Harivansh,Uttar Pradesh,Mathura,443,11,1,Clothing,Saree,COD
3,B-26055,10-03-2018,Harivansh,Uttar Pradesh,Mathura,57,7,2,Clothing,Shirt,UPI
4,B-26055,10-03-2018,Harivansh,Uttar Pradesh,Mathura,227,48,5,Clothing,Stole,COD
...,...,...,...,...,...,...,...,...,...,...,...
1495,B-25742,03-08-2018,Ashwin,Goa,Goa,11,-8,2,Clothing,Skirt,UPI
1496,B-26088,26-03-2018,Bhavna,Sikkim,Gangtok,11,5,2,Clothing,Hankerchief,UPI
1497,B-25707,01-07-2018,Shivani,Maharashtra,Mumbai,8,-6,1,Clothing,Stole,COD
1498,B-25758,22-08-2018,Shubham,Himachal Pradesh,Simla,8,-2,1,Clothing,Stole,COD
1499,B-26095,28-03-2018,Monisha,Rajasthan,Jaipur,6,1,1,Clothing,Kurti,UPI

In [24]:
df2.head()

,Order ID,Order Date,CustomerName,State,City,Amount,Profit,Quantity,Category,Sub-Category,PaymentMode
0,B-26055,10-03-2018,Harivansh,Uttar Pradesh,Mathura,5729,64,14,Furniture,Chairs,EMI
1,B-26055,10-03-2018,Harivansh,Uttar Pradesh,Mathura,671,114,9,Electronics,Phones,Credit Card
2,B-26055,10-03-2018,Harivansh,Uttar Pradesh,Mathura,443,11,1,Clothing,Saree,COD
3,B-26055,10-03-2018,Harivansh,Uttar Pradesh,Mathura,57,7,2,Clothing,Shirt,UPI
4,B-26055,10-03-2018,Harivansh,Uttar Pradesh,Mathura,227,48,5,Clothing,Stole,COD

In [21]:
df2.isnull().sum()

Order ID        0
Order Date      0
CustomerName    0
State           0
City            0
Amount          0
Profit          0
Quantity        0
Category        0
Sub-Category    0
PaymentMode     0
dtype: int64

In [22]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500 entries, 0 to 1499
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Order ID      1500 non-null   object
 1   Order Date    1500 non-null   object
 2   CustomerName  1500 non-null   object
 3   State         1500 non-null   object
 4   City          1500 non-null   object
 5   Amount        1500 non-null   int64
 6   Profit        1500 non-null   int64
 7   Quantity      1500 non-null   int64
 8   Category      1500 non-null   object
 9   Sub-Category  1500 non-null   object
 10  PaymentMode   1500 non-null   object
dtypes: int64(3), object(8)
memory usage: 129.0+ KB

In [23]:
df2.describe()

            Amount      Profit     Quantity
count  1500.000000  1500.00000  1500.000000
mean    291.847333    24.64200     3.743333
std     461.924620   168.55881     2.184942
min       4.000000 -1981.00000     1.000000
25%      47.750000   -12.00000     2.000000
50%     122.000000     8.00000     3.000000
75%     326.250000    38.00000     5.000000
max    5729.000000  1864.00000    14.000000

In [25]:
df2.max()

Order ID            B-26100
Order Date       31-12-2018
CustomerName         Yohann
State           West Bengal
City                Udaipur
Amount                 5729
Profit                 1864
Quantity                 14
Category          Furniture
Sub-Category       Trousers
PaymentMode             UPI
dtype: object

In [27]:
df2.min()

Order ID               B-25601
Order Date          01-01-2018
CustomerName         Aakanksha
State           Andhra Pradesh
City                 Ahmedabad
Amount                       4
Profit                   -1981
Quantity                     1
Category              Clothing
Sub-Category       Accessories
PaymentMode                COD
dtype: object

In [35]:
df2['City'].unique()

array(['Mathura', 'Delhi', 'Mumbai', 'Indore', 'Prayagraj', 'Pune',
       'Hyderabad', 'Surat', 'Ahmedabad', 'Patna', 'Simla', 'Chandigarh',
       'Bhopal', 'Thiruvananthapuram', 'Kohima', 'Udaipur', 'Bangalore',
       'Lucknow', 'Chennai', 'Kolkata', 'Kashmir', 'Jaipur', 'Amritsar',
       'Goa', 'Gangtok'], dtype=object)

In [36]:
df2['City'].value_counts()

City
Indore                248
Mumbai                201
Pune                   98
Delhi                  76
Chandigarh             71
Bhopal                 66
Kolkata                63
Patna                  62
Ahmedabad              62
Bangalore              50
Kashmir                49
Kohima                 45
Thiruvananthapuram     45
Jaipur                 44
Goa                    43
Hyderabad              42
Lucknow                38
Mathura                37
Udaipur                30
Simla                  29
Surat                  25
Chennai                25
Gangtok                24
Amritsar               15
Prayagraj              12
Name: count, dtype: int64

In [42]:
df2['PaymentMode'].unique()

array(['EMI', 'Credit Card', 'COD', 'UPI', 'Debit Card'], dtype=object)

In [44]:
df2.duplicated().sum()

np.int64(0)

In [45]:
df2.shape

(1500, 11)